* LaTeX Header                                                     :noexport:
#+LATEX_COMPILER: xelatex

#+latex_class: my-koma-letter
#+LATEX_CLASS_OPTIONS: [11pt, parskip=half, pagenumber=no, enlargefirstpage, letter]

#+LATEX_HEADER: \newkomavar{subheader}
#+LATEX_HEADER: \setkomavar{subheader}{Warden of the North} % your current role / title

# Letter Class Option
| Country       | Standard    | Window Envelope  | Paper Size | lco                            |
|---------------+-------------+------------------+------------+--------------------------------|
| Germany       | DIN 676     | DIN lang, C4, C5 | A4         | DIN, DINmtext                  |
| France        | NF Z 11-001 | DL               | A4         | NF                             |
| Switzerland   | SN 010 130  | DIN lang, C4, C5 | A4         | SN, SNleft                     |
| United States |             | commercial #9    | Letter     | UScommercial9, UScommercial9DW |
| Japan         |             | Chou/You 3 & 4   | A4         | NipponEL, ...                  |

# #+LATEX_HEADER: \LoadLetterOption{UScommercial9} % remember to set the papersize to letter.
#+LATEX_HEADER: \LoadLetterOption{SSCL}
# #+LATEX_HEADER: \LoadLetterOption{/usr/local/lib/R/3.6/site-library/komaletter/rmarkdown/templates/pdf/resources/maintainersDelight}

# https://cran.r-project.org/web/packages/komaletter/vignettes/intro.html
#+begin_src R
system.file("rmarkdown", "templates", "pdf", "resources", "maintainersDelight.lco", package="komaletter")
#+end_src

#+RESULTS:
: /usr/local/lib/R/3.6/site-library/komaletter/rmarkdown/templates/pdf/resources/maintainersDelight.lco

#+LATEX_HEADER: \usepackage{scrlayer-scrpage}% scrpage2 is outdated
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{fontspec} % Allows font customization
#+LATEX_HEADER: \usepackage{marvosym} % Allows the use of symbols
# #+LATEX_HEADER: \usepackage[english]{babel} % Required to compile in Windows
#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \geometry{verbose,tmargin=1in,bmargin=1in,lmargin=1in,rmargin=1in,footskip = 1mm}
#+LATEX_HEADER: \usepackage[stretch=10]{microtype} % better typesetting. 

# #+LATEX_HEADER: \setlength\parindent{0pt} % Removes all indentation from paragraphs
# #+LATEX_HEADER: \renewcommand{\normalsize}{\fontsize{12.5}{17}\selectfont} % Sets the font size and leading
#+LATEX_HEADER: \renewcommand{\normalsize}{\fontsize{10}{14}\selectfont}

# See chapter 22 of http://texdoc.net/texmf-dist/doc/latex/koma-script/scrguien.pdf 
#+LATEX_HEADER_EXTRA: \makeatletter
# comment out with no signature image
#+LATEX_HEADER_EXTRA: \setplength{sigbeforevskip}{0cm} % space b/w closing and signature
#+LATEX_HEADER_EXTRA: \makeatother

#+LATEX_HEADER_EXTRA: \KOMAoptions{addrfield=true}


